goran-mahovlic/reverse_mono_6ks/Middlewares/ST/STM32_SPI_Emulation/Src/stm32f4_spi_slave_emul.c
/**
  ******************************************************************************
  * @file    stm32f4xx_hal_spi_slave_emul.c
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    30-July-2015
  * @brief   SPI Emulation HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Serial Peripheral Interface (SPI Emulation):
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral State and Errors functions
  *
  @verbatim
   ==============================================================================
                        ##### How to use this driver #####
   ==============================================================================
 [..]
    The SPI Emulation HAL driver can be used as follows:

  (#) Declare a SPI_Emul_HandleTypeDef handle structure.

  (#)Initialize the SPI Emulation low level resources by implementing the HAL_SPI_MspInit ()API:
      (##) Enable the SPI_EMUL  clock.
        (##) SPI Emulation port declaration
            (+++) SPI pins configuration: TxPinNumber, RxPinNumber and ClkPinNumber
            (+++) Enable the clock for the GPIOs

  (#) Program the Mode, Direction , Data size, clock speed, Clock polarity and phase,
       FirstBit and CRC configuration in the hspi Emul Init structure.

  (#) Initialize the SPI Emulation registers software by calling the HAL_SPI_Emul_Init() API.

    -@- The specific SPI Emulaion Handle (Transmission complete, Reception complete
            and Transfer Error ) will be managed using the macros
            HAL_SPI_Emul_TxCpltCallback(), HAL_SPI_Emul_RxCpltCallback() and __HAL_SPI_Emul_TranferError() inside the transmit
            and receive process.

        -@- These API's(HAL_SPI_Emul_Init() configures also the
            low level Hardware GPIO, CLOCK, CORTEX...etc) by calling the customed
            HAL_SPI_Emul_MspInit() API.

    (#) Three mode of operations are available within this driver :

     *** SPI Emulation mode IO operation ***
     ===================================
     [..]
       (+) Send an amount of data in non blocking mode (DMA) using HAL_SPI_Emul_Transmit_DMA()
       (+) At transmission end of transfer HAL_SPI_Emul_TxCpltCallback is executed and user can
            add his own code by customization of function pointer HAL_SPI_Emul_TxCpltCallback
       (+) Receive an amount of data in non blocking mode (DMA) using HAL_SPI_Emul_Receive_DMA()

       (+) At reception end of transfer HAL_SPI_Emul_RxCpltCallback is executed and user can
            add his own code by customization of function pointer HAL_SPI_Emul_RxCpltCallback
       (+) In case of transfer Error, HAL_SPI_ErrorCallback() function is executed and user can
            add his own code by customization of function pointer HAL_SPI_Emul_ErrorCallback

     *** SPI Emulation HAL driver macros list ***
     =============================================
     [..]
       Below the list of most used macros in SPI Emulation HAL driver.

      (+) __HAL_SPI_EMUL_GET_FLAG : Checks whether the specified SPI Emulation flag is set or not
      (+) __HAL_SPI_EMUL_CLEAR_FLAG : Clears the specified SPI Emulation pending flag
      (+) __HAL_SPI_EMUL_SET_FLAG :  Set the specified SPI Emulation  flag

     [..]
       (@) You can refer to the SPI Emulation HAL driver header file for more useful macros

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2015 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "stm32f4xx_spi_slave_emul.h"

/** @addtogroup STM32F4xx_HAL_SPI_SLAVE_EMUL_Driver
  * @{
  */

/** @defgroup SPI_EMUL_HAL_Driver
  * @brief HAL SPI Emulation module driver
  * @{
 */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Timer handler declaration */
static TIM_HandleTypeDef  TimHandle;

/* DMA Handle declaration Tx */
static DMA_HandleTypeDef  hdma_tx;
/* DMA Handle declaration Rx*/
static DMA_HandleTypeDef  hdma_rx;

