goran-mahovlic/reverse_mono_6ks/Middlewares/ST/STM32_SPI_Emulation/Src/stm32f4_spi_slave_emul.c
/* Timer Input Capture Configuration Structure declaration */
static TIM_IC_InitTypeDef       sConfig;
static TIM_IC_InitTypeDef       sConfig1;

/* SPI Emulation Handle */
static SPI_Emul_HandleTypeDef      *hspi_emul;

/* Buffer used for transmission */
static uint32_t *pBuffer_Tx[4*(TX_BUFFER_SIZE)];

/* Buffer used for reception */
static uint32_t *pBuffer_Rx[4*(RX_BUFFER_SIZE)];

/* Private Generic function prototypes -----------------------------------------------*/
static void SPI_Emul_SetConfig (SPI_Emul_HandleTypeDef *spi);
static void SPI_Emul_DMAError(DMA_HandleTypeDef *hdma);
static void SPI_Emul_EnableRessources(void);

/* Private Tx function prototypes -----------------------------------------------*/
static void SPI_Emul_SetConfig_DMATx(void);
static void SPI_Emul_DMAHalfReceiveCplt(DMA_HandleTypeDef *hdma);
static void SPI_Emul_DMATransmitCplt(DMA_HandleTypeDef *hdma);
static void SPI_Emul_DMAHalfTransmitCplt(DMA_HandleTypeDef *hdma);
static void SPI_Emul_TransmitFormatFrame(SPI_Emul_HandleTypeDef *spi , uint16_t pData, uint32_t *pBuffer_tmp_Tx);
static void SPI_Emul_Transmission_Process_Complete(void);

/* Private Rx function prototypes -----------------------------------------------*/
static void SPI_Emul_DMAHalfReceiveCplt(DMA_HandleTypeDef *hdma);
static void SPI_Emul_SetConfig_DMARx(void);
static void SPI_Emul_DMAReceiveCplt(DMA_HandleTypeDef *hdma);
static uint32_t SPI_Emul_ReceiveFormatFrame(SPI_Emul_HandleTypeDef *hspi, uint32_t *pBuffer);
static void SPI_Emul_Reception_Process_Complete(void);

volatile uint32_t IrqTx = 0x00;
volatile uint32_t IrqRx = 0x00;

/* Private functions ---------------------------------------------------------*/

/** @defgroup SPI_EMUL_Exported_Functions_Group1 Initialization and de-initialization functions
 *  @brief    Initialization and Configuration functions
 *
@verbatim
 ===============================================================================
              ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]  This subsection provides a set of functions allowing to initialize and
          de-initialize the SPI Emulator:

(+) Call the function HAL_SPI_Emul_Init() to configure these parameters:
        (++) Mode
        (++) Direction
        (++) Data Size
        (++) Clock Polarity and Phase
        (++) NSS Management
        (++) Clock Speed
        (++) FirstBit
        (++) TIMode
        (++) CRC Calculation
        (++) CRC Polynomial if CRC enabled

      (+) Call the function HAL_SPI_DeInit() to restore the default configuration
          of the SPI Emulator.

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the SPI Emulation according to the specified parameters
  *         in the SPI_Emul_InitTypeDef and create the associated handle.
  * @param  hspi: SPI Emulation handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SPI_Emul_Init(SPI_Emul_HandleTypeDef *hspi)
{
  /* Check the SPI handle allocation */
  if (hspi == NULL)
  {
    return HAL_ERROR;
  }
  if (hspi->State == HAL_SPI_EMUL_STATE_RESET)
  {
    /* Init the low level hardware : GPIO, CLOCK, NVIC... */
    HAL_SPI_Emul_MspInit(hspi);
  }

  /* Get Structure for spi emul Handle */
  hspi_emul = hspi;

  /* Set the TIM state */
  hspi->State = HAL_SPI_EMUL_STATE_BUSY;


  /* Set the SPI Emulation Communication parameters */
  SPI_Emul_SetConfig(hspi);

  /* Initialize the SPI Emulation state */
  hspi->ErrorCode = HAL_SPI_EMUL_ERROR_NONE;
  hspi->State = HAL_SPI_EMUL_STATE_READY;

  return HAL_OK;
}

/**
  * @brief  DeInitializes the SPI Emulation .
  * @param  hSPI: SPI Emulation handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SPI_Emul_DeInit(SPI_Emul_HandleTypeDef *hspi)
{
  /* Check the SPI handle allocation */
  if (hspi == NULL)
  {
    return HAL_ERROR;
  }
  /* DeInit the low level hardware: GPIO, CLOCK, NVIC... */
  HAL_SPI_Emul_MspDeInit(hspi);

  hspi->ErrorCode = HAL_SPI_EMUL_ERROR_NONE;
  hspi->State = HAL_SPI_EMUL_STATE_RESET;

  return HAL_OK;
}

/**
  * @brief SPI Emulation MSP Init.
  * @param  hspi: SPI Emulation Handle.
  * @retval None
  */
__weak void HAL_SPI_Emul_MspInit(SPI_Emul_HandleTypeDef *hspi)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
           the HAL_SPI_Emul_MspInit could be implemented in the user file
  */
}

/**
  * @brief SPI Emulation MSP DeInit
  * @param  hspi: SPI Emulation handle
  * @retval None
  */
__weak void HAL_SPI_Emul_MspDeInit(SPI_Emul_HandleTypeDef *hspi)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_SPI_Emul_MspDeInit could be implemented in the user file
   */
}

/**
  * @}
  */
/**
  * @brief  Configures the SPI Emulation peripheral.
             + Enable clock for ALL peripheral Timer, GPIO
             + DMA 2 Configuration channel, Stream, Mode? Priority, ...
             + Configuration SPI Emulation CR registre software
  * @param  hspi: SPI Emulation handle
  * @retval None
  */
static void SPI_Emul_SetConfig (SPI_Emul_HandleTypeDef *hspi)
{
  /* Check the parameters */
  assert_param(IS_SPI_EMUL_MODE(hspi->Init.Mode));
  assert_param(IS_SPI_EMUL_DIRECTION(hspi->Init.Direction));
  assert_param(IS_SPI_EMUL_DATASIZE(hspi->Init.DataSize));
  assert_param(IS_SPI_EMUL_POLARITY(hspi->Init.CLKPolarity));
  assert_param(IS_SPI_EMUL_PHASE(hspi->Init.CLKPhase));
  assert_param(IS_SPI_CLK(hspi->Init.SPI_Clk));
  assert_param(IS_SPI_EMUL_FIRSTBIT(hspi->Init.FirstBit));

  /* Initialize TIM1 peripheral as follow:
  + Period = TimerPeriod 
  + Prescaler = 0
  + ClockDivision = 0
  + Counter direction = Up
  */

  TimHandle.Instance            = TIM1;
  TimHandle.Init.Period         = 0xFFFF;
  TimHandle.Init.Prescaler      = 0;
  TimHandle.Init.ClockDivision  = 0;
  TimHandle.Init.CounterMode    = TIM_COUNTERMODE_UP;
  HAL_TIM_IC_Init(&TimHandle);

  sConfig.ICSelection = TIM_ICSELECTION_DIRECTTI;
  sConfig.ICPrescaler = TIM_ICPSC_DIV1;
  sConfig.ICFilter    = 0;
  HAL_TIM_IC_ConfigChannel(&TimHandle, &sConfig, TIM_CHANNEL_2);

  if (hspi->Init.CLKPhase == SPI_EMUL_PHASE_1EDGE)
  {
    sConfig1.ICPolarity  = TIM_ICPOLARITY_FALLING;
    sConfig.ICPolarity  = TIM_ICPOLARITY_FALLING;
  }
  else if (hspi->Init.CLKPhase == SPI_EMUL_PHASE_2EDGE)
  {
    sConfig1.ICPolarity  = TIM_ICPOLARITY_RISING;
    sConfig.ICPolarity  = TIM_ICPOLARITY_RISING;
  }

  sConfig1.ICSelection = TIM_ICSELECTION_INDIRECTTI;
  sConfig1.ICPrescaler = TIM_ICPSC_DIV1;
  sConfig1.ICFilter    = 0;
  HAL_TIM_IC_ConfigChannel(&TimHandle, &sConfig1, TIM_CHANNEL_1);

  if ((hspi->Init.Direction == SPI_EMUL_DIRECTION_TX) && (hspi->Init.Mode == SPI_EMUL_MODE_SLAVE))
  {
    /* Configure SPI Emulation in Transmission mode */
    SPI_Emul_SetConfig_DMATx();
  }
  else if ((hspi->Init.Direction == SPI_EMUL_DIRECTION_RX) && (hspi->Init.Mode == SPI_EMUL_MODE_SLAVE))
  {
    /* Configure SPI Emulation in Reception mode */
    SPI_Emul_SetConfig_DMARx();
  }
  else if ((hspi->Init.Direction == SPI_EMUL_DIRECTION_TX_RX) && (hspi->Init.Mode == SPI_EMUL_MODE_SLAVE))
  {
    /* Configure SPI Emulation in full-duplex mode */
    SPI_Emul_SetConfig_DMATx();
    SPI_Emul_SetConfig_DMARx();
  }
}

/*********************************************************************/
/*********************************************************************/
/***************************Transmission Process**********************/
/*********************************************************************/
/*********************************************************************/

/**
  * @brief  Configures the DMA for SPI Emulation transmission.
             + DMA 2 Configuration channel, Stream, Mode? Priority, ...
  * @param  None
  * @retval None
  */
static void SPI_Emul_SetConfig_DMATx(void)
{
  /*##-1- Configure  DMA For SPI Emulation TX #############################*/
  /* Set the parameters to be configured */
  hdma_tx.Init.Channel              = DMA_CHANNEL_6;                /* DMA_CHANNEL_6                        */
  hdma_tx.Init.Direction            = DMA_MEMORY_TO_PERIPH;         /* Transfer mode                        */
  hdma_tx.Init.PeriphInc            = DMA_PINC_DISABLE;             /* Peripheral increment mode Disable    */
  hdma_tx.Init.MemInc               = DMA_MINC_ENABLE;              /* Memory increment mode Enable         */
  hdma_tx.Init.PeriphDataAlignment  = DMA_PDATAALIGN_WORD ;         /* Peripheral data alignment : Word     */
  hdma_tx.Init.MemDataAlignment     = DMA_MDATAALIGN_WORD ;         /* memory data alignment :  Word        */
  hdma_tx.Init.Mode                 = DMA_CIRCULAR;                 /* Circular DMA mode                    */
  hdma_tx.Init.Priority             = DMA_PRIORITY_HIGH;            /* priority level : high                */
  hdma_tx.Init.FIFOMode             = DMA_FIFOMODE_DISABLE;         /* FIFO mode disabled                   */
  hdma_tx.Init.FIFOThreshold        = DMA_FIFO_THRESHOLD_FULL;      /* FIFO threshold full configuration    */
  hdma_tx.Init.MemBurst             = DMA_MBURST_SINGLE;            /* Memory burst                         */
  hdma_tx.Init.PeriphBurst          = DMA_PBURST_SINGLE;            /* Peripheral burst                     */

