goran-mahovlic/reverse_mono_6ks/Middlewares/ST/STM32_SPI_Emulation/Src/stm32f4_spi_slave_emul.c
  /* Set hdma_tim instance */
  hdma_tx.Instance = DMA2_Stream1;
  hdma_tx.Parent = TimHandle.hdma[1];

  /* Link hdma_tim to hdma[ ] ( channel Tx or Rx) */
  __HAL_LINKDMA(&TimHandle, hdma[1] , hdma_tx);

  /* Initialize TIMx DMA handle */
  HAL_DMA_Init(TimHandle.hdma[1]);

  /* Configure DMA Stream source and destination address */
  hdma_tx.Instance->PAR =  (uint32_t) & ((hspi_emul->RxPortName)->BSRR);
  hdma_tx.Instance->M0AR = (uint32_t) & pBuffer_Tx[0];

  /*##-2- NVIC configuration for DMA transfer complete interrupt ###########*/
  HAL_NVIC_SetPriority(DMA2_Stream1_IRQn, 2, 2);
  HAL_NVIC_EnableIRQ(DMA2_Stream1_IRQn);

  /* Configure DMA Stream data length */
  if ((hspi_emul->Init.FirstBit == SPI_EMUL_FIRSTBIT_MSB) && (hspi_emul->Init.DataSize == SPI_EMUL_DATASIZE_16BIT))
  {
    hdma_tx.Instance->NDTR = NUMBER_OF_DATA_ITEMS;
  }
  else
  {
    hdma_tx.Instance->NDTR = NUMBER_OF_DATA_ITEMS / 2;
  }
}

/**
 * @brief  Receives an amount of data
 * @param  hspi: SPI Emulation handle
 * @param  pData: Pointer to data buffer
 * @param  Size: Amount of data to be sent
 * @retval HAL status
*/
HAL_StatusTypeDef HAL_SPI_Emul_Transmit_DMA(SPI_Emul_HandleTypeDef *hspi, uint8_t *pData, uint16_t Size)
{
  uint32_t counter_format = 0;
  uint32_t counter_shift = 0;
  uint16_t pData_16bit = 0;
  uint32_t test_hal_spi_state_ready = HAL_SPI_STATE_READY;
  if ((hspi->State == test_hal_spi_state_ready) || (hspi->State == HAL_SPI_EMUL_STATE_BUSY_RX))
  {
    if ((pData == NULL) || (Size == 0))
    {
      return  HAL_ERROR;
    }
    /* Configure communication */
    hspi->ErrorCode   = HAL_SPI_EMUL_ERROR_NONE;

    hspi->TxXferSize  = Size;
    hspi->pTxBuffPtr  = pData;
    hspi->TxXferCount = 0;

    /* Check if a receive process is ongoing or not */
    if (hspi->State == HAL_SPI_EMUL_STATE_BUSY_RX)
    {
      hspi->State = HAL_SPI_EMUL_STATE_BUSY_TX_RX;
    }
    else
    {
      hspi->State = HAL_SPI_EMUL_STATE_BUSY_TX;
    }

    SPI_Emul_SetConfig_DMATx();

    /* Set the SPI TxDMA transfer complete callback */
    TimHandle.hdma[TIM_DMA_ID_CC1]->XferCpltCallback = SPI_Emul_DMATransmitCplt;

    /* Set the SPI TxDMA transfer half callback */
    TimHandle.hdma[TIM_DMA_ID_CC1]->XferHalfCpltCallback = SPI_Emul_DMAHalfTransmitCplt;

    /* Set the DMA error callback */
    TimHandle.hdma[TIM_DMA_ID_CC1]->XferErrorCallback = SPI_Emul_DMAError;

    if ((hspi_emul->Init.FirstBit == SPI_EMUL_FIRSTBIT_MSB) && (hspi_emul->Init.DataSize == SPI_EMUL_DATASIZE_16BIT))
    {
      for (counter_format = 0; counter_format < 20; counter_format++)
      {
        pData_16bit = (pData[counter_shift+1] << ONE_BYTE) | pData[counter_shift];
        SPI_Emul_TransmitFormatFrame(hspi, pData_16bit, (uint32_t*)(pBuffer_Tx + counter_format*16));
        hspi_emul->TxXferCount++;
        counter_shift += 2;
      }
    }
    else
    {
      for (counter_format = 0; counter_format < 20; counter_format++)
      {
        SPI_Emul_TransmitFormatFrame(hspi, *(pData + counter_format), (uint32_t*)(pBuffer_Tx + counter_format*8));
        hspi_emul->TxXferCount++;
      }
    }
    SPI_Emul_EnableRessources();

    if (hspi->Init.CLKPhase == SPI_EMUL_PHASE_1EDGE)
    {
      TIMx->EGR |= 0x02;
    }

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief  This function is executed to enable reception ressources
  * @param  None
  * @retval None
  */
static void SPI_Emul_EnableRessources()
{
  if ((hspi_emul->Init.Direction == SPI_EMUL_DIRECTION_TX_RX) || (hspi_emul->Init.Direction == SPI_EMUL_DIRECTION_RX))
  {
    /* Enable the Capture compare channel */
    TIM_CCxChannelCmd(TIM1, TIM_CHANNEL_2, TIM_CCx_ENABLE);

    /* Enable the Peripheral */
    __HAL_TIM_ENABLE(&TimHandle);

    /* Enable the transfer complete interrupt */
    __HAL_DMA_ENABLE_IT(&hdma_rx, DMA_IT_TC);

    /* Enable the half transfer interrupt */
    __HAL_DMA_ENABLE_IT(&hdma_rx, DMA_IT_HT);

    /* Enable the transfer Error interrupt */
    __HAL_DMA_ENABLE_IT(&hdma_rx, DMA_IT_TE);

    /* Enable the TIM Update DMA request */
    __HAL_TIM_ENABLE_DMA(&TimHandle, TIM_DMA_CC2);

    __HAL_DMA_ENABLE(&hdma_rx);
  }
  if ((hspi_emul->Init.Direction == SPI_EMUL_DIRECTION_TX_RX) || (hspi_emul->Init.Direction == SPI_EMUL_DIRECTION_TX))
  {
    /* Enable the Capture compare channel */
    TIM_CCxChannelCmd(TIM1, TIM_CHANNEL_1, TIM_CCx_ENABLE);

    /* Enable the Peripheral */
    __HAL_TIM_ENABLE(&TimHandle);

    /* Enable the transfer complete interrupt */
    __HAL_DMA_ENABLE_IT(&hdma_tx, DMA_IT_TC);

    /* Enable the half transfer interrupt */
    __HAL_DMA_ENABLE_IT(&hdma_tx, DMA_IT_HT);

    /* Enable the transfer Error interrupt */
    __HAL_DMA_ENABLE_IT(&hdma_tx, DMA_IT_TE);

    /* Enable the TIM Update DMA request */
    __HAL_TIM_ENABLE_DMA(&TimHandle, TIM_DMA_CC1);

    __HAL_DMA_ENABLE(&hdma_tx);
  }
}

/**
  * @brief  This function is executed in case of Receive Complete for one Frame.
  * @param  None
  * @retval None
  */
static void SPI_Emul_DMATransmitCplt(DMA_HandleTypeDef *hdma)
{
  uint8_t pData_8bit = 0;
  uint16_t pData_16bit = 0;
  uint32_t counter_format = 0;

  if ((hspi_emul->Init.FirstBit == SPI_EMUL_FIRSTBIT_MSB) && (hspi_emul->Init.DataSize == SPI_EMUL_DATASIZE_16BIT))
  {
    if (hspi_emul->TxXferCount <= hspi_emul->TxXferSize - 10)
    {
      for (counter_format = 10; counter_format < 20; counter_format++)
      {
        pData_8bit = *(hspi_emul->pTxBuffPtr + (hspi_emul->TxXferCount++));
        pData_16bit = ((pData_8bit + 1) << ONE_BYTE) | pData_8bit;
        SPI_Emul_TransmitFormatFrame(hspi_emul, pData_16bit, (uint32_t*)&pBuffer_Tx[counter_format*(hspi_emul->Init.DataSize)]);
        hspi_emul->TxXferCount++;
      }
    }
    else
    {
      SPI_Emul_Transmission_Process_Complete();
      /* Handle for SPI Emulation Transfer Complete */
      HAL_SPI_Emul_TxCpltCallback(hspi_emul);
    }
  }
  else
  {
    if (hspi_emul->TxXferCount <= hspi_emul->TxXferSize)
    {
      for (counter_format = 10; counter_format < 20; counter_format++)
      {
        pData_8bit = *(hspi_emul->pTxBuffPtr + (hspi_emul->TxXferCount++));
        SPI_Emul_TransmitFormatFrame(hspi_emul, pData_8bit , (uint32_t*)&pBuffer_Tx[counter_format*8]);
      }
    }
    else
    {
      SPI_Emul_Transmission_Process_Complete();
      /* Handle for SPI Emulation Transfer Complete */
      HAL_SPI_Emul_TxCpltCallback(hspi_emul);
    }
  }
}

/**
  * @brief  This function is executed in case of Half Transfer Complete.
  * @param  None
  * @retval None
  */
static void SPI_Emul_DMAHalfTransmitCplt(DMA_HandleTypeDef *hdma)
{
  uint8_t pData_8bit = 0;
  uint16_t pData_16bit = 0;
  uint32_t counter_format = 0;

  if ((hspi_emul->Init.FirstBit == SPI_EMUL_FIRSTBIT_MSB) && (hspi_emul->Init.DataSize == SPI_EMUL_DATASIZE_16BIT))
  {
    if (hspi_emul->TxXferCount <= hspi_emul->TxXferSize - 10)
    {
      for (counter_format = 0; counter_format < 10; counter_format++)
      {
        pData_8bit = *(hspi_emul->pTxBuffPtr + (hspi_emul->TxXferCount++));
        pData_16bit = ((pData_8bit + 1) << ONE_BYTE) | pData_8bit;
        SPI_Emul_TransmitFormatFrame(hspi_emul, pData_16bit , (uint32_t*)&pBuffer_Tx[counter_format*16]);
        hspi_emul->TxXferCount++;
      }
    }
    else
    {
      SPI_Emul_Transmission_Process_Complete();
      HAL_SPI_Emul_TxHalfCpltCallback(hspi_emul);
    }
  }
  else
  {
    if (hspi_emul->TxXferCount <= hspi_emul->TxXferSize)
    {
      for (counter_format = 0; counter_format < 10; counter_format++)
      {
        pData_8bit = *(hspi_emul->pTxBuffPtr + (hspi_emul->TxXferCount++));
        SPI_Emul_TransmitFormatFrame(hspi_emul, pData_8bit, (uint32_t*)&pBuffer_Tx[counter_format*8]);
      }
    }
    else
    {
      SPI_Emul_Transmission_Process_Complete();
      HAL_SPI_Emul_TxCpltCallback(hspi_emul);
    }
  }
}

/**
  * @brief  This function disable ressources
  * @param  None
  * @retval None
  */
static void SPI_Emul_Transmission_Process_Complete(void)
{
  /* Disable the Input Capture channel */
  TIM_CCxChannelCmd(TIM1, TIM_CHANNEL_2, TIM_CCx_DISABLE);

  /* Disable the Peripheral */
  __HAL_TIM_DISABLE(&TimHandle);

  hspi_emul->TxXferCount = 0;

  /* Set TC flag in the SR registre software */
  __HAL_SPI_EMUL_SET_FLAG(hspi_emul, SPI_EMUL_FLAG_TC);


  __HAL_DMA_DISABLE(TimHandle.hdma[TIM_DMA_ID_CC1]);

