goran-mahovlic/reverse_mono_6ks/Middlewares/ST/STM32_SPI_Emulation/Src/stm32f4_spi_slave_emul.c
  /* Set hdma_tim instance */
  hdma_rx.Instance = DMA2_Stream2;
  hdma_rx.Parent = TimHandle.hdma[2];

  /* Link hdma_tim to hdma[ ] ( channel Tx or Rx) */
  __HAL_LINKDMA(&TimHandle, hdma[2] , hdma_rx);

  /* Initialize TIMx DMA handle */
  HAL_DMA_Init(TimHandle.hdma[2]);

  /*##-2- NVIC configuration for DMA transfer complete interrupt ###########*/
  HAL_NVIC_SetPriority(DMA2_Stream2_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA2_Stream2_IRQn);

  /* Configure DMA Stream source and destination address */
  hdma_rx.Instance->PAR = (uint32_t) & ((hspi_emul->RxPortName)->IDR);
  hdma_rx.Instance->M0AR  = (uint32_t)pBuffer_Rx;

  /* Configure DMA Stream data length */
  hdma_rx.Instance->NDTR = 2 * 10 * (hspi_emul->Init.DataSize);
}

/**
 * @brief  Receives an amount of data
 * @param  hspi: SPI Emulation handle
 * @param  pData: Pointer to data buffer
 * @param  Size: Amount of data to be sent
 * @retval HAL status
*/
HAL_StatusTypeDef HAL_SPI_Emul_Receive_DMA(SPI_Emul_HandleTypeDef *hspi, uint8_t *pData, uint16_t Size)
{
  uint32_t test_hal_spi_state_ready = HAL_SPI_STATE_READY;

  if ((hspi->State == test_hal_spi_state_ready) || (hspi->State == HAL_SPI_EMUL_STATE_BUSY_TX))
  {
    if ((pData == NULL) || (Size == 0))
    {
      return  HAL_ERROR;
    }

    /* Configure communication */
    hspi->ErrorCode   = HAL_SPI_EMUL_ERROR_NONE;

    hspi->RxXferSize  = Size;
    hspi->pTxBuffPtr  = pData;
    hspi->RxXferCount = 0;

    /* Check if a receive process is ongoing or not */
    if (hspi->State == HAL_SPI_EMUL_STATE_BUSY_TX)
    {
      hspi->State = HAL_SPI_EMUL_STATE_BUSY_TX_RX;
    }
    else
    {
      hspi->State = HAL_SPI_EMUL_STATE_BUSY_RX;
    }

    /* Set the SPI TxDMA transfer complete callback */
    TimHandle.hdma[TIM_DMA_ID_CC2]->XferCpltCallback = SPI_Emul_DMAReceiveCplt;

    /* Set the SPI TxDMA transfer half callback */
    TimHandle.hdma[TIM_DMA_ID_CC2]->XferHalfCpltCallback = SPI_Emul_DMAHalfReceiveCplt;

    /* Set the DMA error callback */
    TimHandle.hdma[TIM_DMA_ID_CC2]->XferErrorCallback = SPI_Emul_DMAError;

    SPI_Emul_EnableRessources();
    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief  This function is executed in case of Receive Complete for one Frame.
  * @param  None
  * @retval None
  */
static void SPI_Emul_DMAReceiveCplt(DMA_HandleTypeDef *hdma)
{
  uint32_t counter_format = 0;
  if ((hspi_emul->RxXferCount + (10)) <= (hspi_emul->RxXferSize))
  {
    for (counter_format = (10); counter_format < (20); counter_format++)
    {
      hspi_emul->pRxBuffPtr[hspi_emul->RxXferCount] = SPI_Emul_ReceiveFormatFrame(hspi_emul, (uint32_t*) & pBuffer_Rx[(hspi_emul->Init.DataSize)*counter_format]);
      hspi_emul->RxXferCount ++;
    }
  }
  else
  {
    SPI_Emul_Reception_Process_Complete();
    HAL_SPI_Emul_RxCpltCallback(hspi_emul);
  }

}

/**
  * @brief  This function is executed in case of Transfer Half for one Frame.
  * @param  None
  * @retval None
  */
static void SPI_Emul_DMAHalfReceiveCplt(DMA_HandleTypeDef *hdma)
{
  uint32_t counter_format;
  if ((hspi_emul->RxXferCount + (10)) <= (hspi_emul->RxXferSize))
  {
    for (counter_format = 0; counter_format < (10); counter_format++)
    {
      hspi_emul->pRxBuffPtr[hspi_emul->RxXferCount] = SPI_Emul_ReceiveFormatFrame(hspi_emul, (uint32_t*) & pBuffer_Rx[(hspi_emul->Init.DataSize)*counter_format]);
      hspi_emul->RxXferCount ++;
    }
  }
  else
  {
    SPI_Emul_Reception_Process_Complete();
    HAL_SPI_Emul_RxHalfCpltCallback(hspi_emul);
  }
}

/**
  * @brief  This function disable ressources
  * @param  None
  * @retval None
  */
static void SPI_Emul_Reception_Process_Complete()

{
  /* Disable the Input Capture channel */
  TIM_CCxChannelCmd(TIM1, TIM_CHANNEL_2, TIM_CCx_DISABLE);

  /* Disable the Peripheral */
  __HAL_TIM_DISABLE(&TimHandle);

  /* Set TC flag in the SR registre software */
  __HAL_SPI_EMUL_SET_FLAG(hspi_emul, SPI_EMUL_FLAG_TC);


  __HAL_DMA_DISABLE(TimHandle.hdma[TIM_DMA_ID_CC2]);

  /* Initialize the SPI Emulation state */
  hspi_emul->ErrorCode = HAL_SPI_EMUL_ERROR_NONE;

  /* Check if a receive process is ongoing or not */
  if (hspi_emul->State == HAL_SPI_EMUL_STATE_BUSY_TX_RX)
  {
    hspi_emul->State = HAL_SPI_EMUL_STATE_BUSY_TX;
  }
  else
  {
    hspi_emul->State = HAL_SPI_EMUL_STATE_READY;
  }
}

/**
 * @brief  Format Frame in Receiver mode.
 * @param  hspi: SPI Emulation handle
 * @param  pBuffer: pointer of receiver Buffer
 * @param  pFrame: pointer of Frame
 * @retval None
*/
static uint32_t SPI_Emul_ReceiveFormatFrame(SPI_Emul_HandleTypeDef *hspi, uint32_t *pBuffer_tmp_Rx)
{
  uint32_t counter = 0;
  uint32_t length = 0;
  uint32_t received_data = 0;

  /* Get Length of frame */
  length = hspi->Init.DataSize;

  if (hspi->Init.FirstBit == SPI_EMUL_FIRSTBIT_LSB)
  {
    for (counter = 0; counter < length ; counter++)
    {
      if ((pBuffer_tmp_Rx[counter]&(hspi->Init.RxPinNumber)) == (hspi->Init.RxPinNumber))
      {
        received_data = (BitMask_LSB << counter) | received_data;
      }
    }
  }
  else if (hspi->Init.FirstBit == SPI_EMUL_FIRSTBIT_MSB)
  {
    for (counter = 0; counter < length; counter++)
    {
      if ((pBuffer_tmp_Rx[counter]&(hspi->Init.RxPinNumber)) == (hspi->Init.RxPinNumber))
      {
        if (hspi->Init.DataSize == SPI_EMUL_DATASIZE_8BIT)
        {
          received_data = (BitMask_MSB_8bit >> counter) | received_data;
        }
        else if (hspi->Init.DataSize == SPI_EMUL_DATASIZE_16BIT)
        {
          received_data = (BitMask_MSB_16bit >> counter) | received_data;
        }
      }
    }
  }

  return received_data;
}


/**
* @brief  This function handles DMA interrupt request for TC.
* @param  None
* @retval None
*/
void SPI_EMUL_RX_DMA_IRQHandler(void)
{
  if (IrqRx == 0)
  {

    TimHandle.hdma[TIM_DMA_ID_CC2]->XferHalfCpltCallback(TimHandle.hdma[TIM_DMA_ID_CC2]);
    __HAL_DMA_CLEAR_FLAG(TimHandle.hdma[TIM_DMA_ID_CC2], __HAL_DMA_GET_HT_FLAG_INDEX(TimHandle.hdma[TIM_DMA_ID_CC2]));
    IrqRx = 1;
  }
  /* Transfer complete callback */
  else
  {
    TimHandle.hdma[TIM_DMA_ID_CC2]->XferCpltCallback(TimHandle.hdma[TIM_DMA_ID_CC2]);

    __HAL_DMA_CLEAR_FLAG(TimHandle.hdma[TIM_DMA_ID_CC2], __HAL_DMA_GET_TC_FLAG_INDEX(TimHandle.hdma[TIM_DMA_ID_CC2]));
    IrqRx = 0;
  }
}

/**
  * @brief  Initializes the SPI Emulation Receive Complete.
  * @param  hspi: SPI Emulation Handle
  * @retval None
  */
__weak void HAL_SPI_Emul_RxCpltCallback(SPI_Emul_HandleTypeDef *hspi)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_SPI_Emul_TransferComplet could be implemented in the user file
   */
}

/**
  * @brief  Initializes the SPI Emulation Half Receive Complete.
  * @param  hspi: SPI Emulation Handle
  * @retval None
  */
__weak void HAL_SPI_Emul_RxHalfCpltCallback(SPI_Emul_HandleTypeDef *hspi)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_SPI_Emul_TransferComplete could be implemented in the user file
   */
}

/**
  * @brief  Transmit and Receive an amount of data in no-blocking mode with DMA
  * @param  hspi: pointer to a SPI_Emul_HandleTypeDef structure that contains
  *                the configuration information for SPI module.
  * @param  pTxData: pointer to transmission data buffer
  * @param  pRxData: pointer to reception data buffer
  * @param  Size: amount of data to be sent
  * @retval HAL status
  */


HAL_StatusTypeDef HAL_SPI_Emul_TransmitReceive_DMA(SPI_Emul_HandleTypeDef *hspi, uint8_t *pTxData, uint8_t *pRxData, uint16_t Size)
{
  uint32_t counter_format = 0;
  uint32_t counter_shift = 0;
  uint16_t pData_16bit = 0;
  uint32_t tmpstate = 0;
  tmpstate = hspi->State;

  if ((tmpstate == HAL_SPI_STATE_READY) || ((hspi->Init.Mode == SPI_MODE_MASTER) && \
      (hspi->Init.Direction == SPI_EMUL_DIRECTION_TX_RX) && (tmpstate == HAL_SPI_STATE_BUSY_RX)))
  {
    if ((pTxData == NULL ) || (pRxData == NULL ) || (Size == 0))
    {
      return  HAL_ERROR;
    }

    /* Check the parameters */
    assert_param(SPI_EMUL_DIRECTION_TX_RX(hspi->Init.Direction));

    /* Configure communication */
    hspi->ErrorCode   = HAL_SPI_EMUL_ERROR_NONE;

    hspi->TxXferSize  = Size;
    hspi->RxXferSize  = Size;
    hspi->pTxBuffPtr  = pTxData;
    hspi->pRxBuffPtr  = pRxData;
    hspi->TxXferCount = 0;


    /* Don't overwrite in case of HAL_SPI_STATE_BUSY_RX */
    if (hspi->State != HAL_SPI_EMUL_STATE_BUSY_RX)
    {
      hspi->State = HAL_SPI_EMUL_STATE_BUSY_TX_RX;
    }

    /* Set the SPI TxDMA transfer complete callback */
    TimHandle.hdma[TIM_DMA_ID_CC1]->XferCpltCallback = SPI_Emul_DMATransmitCplt;

    /* Set the SPI TxDMA transfer half callback */
    TimHandle.hdma[TIM_DMA_ID_CC1]->XferHalfCpltCallback = SPI_Emul_DMAHalfTransmitCplt;

    /* Set the DMA error callback */
    TimHandle.hdma[TIM_DMA_ID_CC1]->XferErrorCallback = SPI_Emul_DMAError;

    /* Set the SPI RxDMA transfer complete callback */
    TimHandle.hdma[TIM_DMA_ID_CC2]->XferCpltCallback = SPI_Emul_DMAReceiveCplt;

    /* Set the SPI RxDMA transfer half callback */
    TimHandle.hdma[TIM_DMA_ID_CC2]->XferHalfCpltCallback = SPI_Emul_DMAHalfReceiveCplt;

    /* Set the DMA error callback */
    TimHandle.hdma[TIM_DMA_ID_CC2]->XferErrorCallback = SPI_Emul_DMAError;

    if ((hspi_emul->Init.FirstBit == SPI_EMUL_FIRSTBIT_MSB) && (hspi_emul->Init.DataSize == SPI_EMUL_DATASIZE_16BIT))
    {
      for (counter_format = 0; counter_format < 20; counter_format++)
      {
        pData_16bit = (pTxData[counter_shift+1] << ONE_BYTE) | pTxData[counter_shift];
        SPI_Emul_TransmitFormatFrame(hspi, pData_16bit, (uint32_t*)(pBuffer_Tx + counter_format*16));
        hspi_emul->TxXferCount++;
        counter_shift += 2;
      }
    }
    else
    {
      for (counter_format = 0; counter_format < 20; counter_format++)
      {
        SPI_Emul_TransmitFormatFrame(hspi, *(pTxData + counter_format), (uint32_t*)(pBuffer_Tx + counter_format*8));
        hspi_emul->TxXferCount++;
      }
    }
    SPI_Emul_EnableRessources();

    if (hspi->Init.CLKPhase == SPI_EMUL_PHASE_1EDGE)
    {
      TIMx->EGR |= 0x02;
    }

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
